import { Component } from '@angular/core';
import { OwlOptions } from 'ngx-owl-carousel-o';
@Component({
  selector: 'app-category',
  templateUrl: './category.component.html',
  styleUrls: ['./category.component.css']
})
export class CategoryComponent {
  customOptions: OwlOptions = {
    autoplayHoverPause: true,
    autoplay: true,
    loop: true,
    mouseDrag: true,
    touchDrag: true,
    pullDrag: false,
    dots: false,
    navSpeed: 3000,
    autoplayTimeout:2000 ,
    navText: ['', ''],
      responsive: {
        0: {
          items: 1
        },
        400: {
          items: 1
        },
        740: {
          items: 3
        },
        940: {
          items: 4
        }
      },
    nav: true
  }
  categories:any=[
    {ImageSrc:"assets/images/مبيدات فطرية 1.jfif",nameCategory:"مبيدات فطرية خام"},
    {ImageSrc:"assets/images/WhatsApp Image 1.jpeg",nameCategory:"مبيدات حشرية خام "},
    {ImageSrc:"assets/images/منظمات نمو 1.jfif",nameCategory:"منظمات نمو خام"},
    {ImageSrc:"assets/images/مبيدات فطرية 2.jfif",nameCategory:"مبيدات فطرية منتج نهائي"},
    {ImageSrc:"assets/images/WhatsApp Image2.jpeg",nameCategory:" مبيدات حشرية منتج نهائي" },
    {ImageSrc:"assets/images/منطمات نمو 2.jfif",nameCategory:"منظمات نمو منتج نهائي"},

  ];

  products:any=[
    {
      image:"assets/images/Carbendazim .jpeg",
      name:"كاربندازيم ",
      concentration:"50",
      categoryName:"مبيدات فطرية مصنعة"
    },
    {
      "image":"assets/images/Mancozeb.jpeg",
      "name":"مانكوزيب ",
      "concentration":"80",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"مانكوزيب 80% - Mancozeb مبيد فطرى واسع المدى، وقائي، يؤثر بالملامسة يحتوى أيضا على المادة الفعالة مانكوزيب 80٪ التي تحقق حماية خارجية كاملة نظراً لتأثيرها الإبادي القوي على الفطريات المسببة للبياض الزغبي والندوات.",
      "counter":"متوفر شكاير 25 كيلو - عبوات كيلو"
    },
    {
      "image":"assets/images/Tolclofos .jpeg",
      "name":"تولكلوفوس ميثيل ",
      "concentration":"20",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"تولكلوفوس ميثيل 20% + ثيرام 30% (ريزولكس )اقوى و أفضل مبيد فطري على الإطلاق ضد اعفان الجذور و مرض النيماتودا عقد الجذور .",
      "counter":"متوفر شكاير 25 كيلو - عبوات كيلو"
    },
    {
      "image":"assets/images/Dimethomorph.jpeg",
      "name":"دايميثومورف ",
      "concentration":"50",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"دايميثومورف 50 % (Dimethomorph 50%) مبيد فطرى وقائى  جهازى التأثير يحتوى على 50% دايميثومورف كمادة فعالة تؤثر على فطريات البياض الزغبى التى تصيب العنب والقرعيات ومحاصيل اخرى والفطريات ذات القرابة منها ،وعلى الندوات فى البطاطس و الطماطم.",
      "counter":"متوفر شكاير 25 كيلو - عبوات كيلو"
    },
    {
      "image":"assets/images/1Difenoconazole.jpeg",
      "name":"ديفيناكونازول 25%  - Difenoconazole ",
      "concentration":"25",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"يفيناكونازول 25%  - Difenoconazoleمبيد (وقائي علاجي) له تأثير جهازي ينتقل عن طريق العصارة النباتية و ينتشر في كل أجزاء النبات بسرعة فيعمل على وقايته و كذلك له القدرة على القضاء على نمو الفطريات الموجودة تحت بشرة الورقة مما يؤكد فعاليته بعد حدوث الإصابة.",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر - عبوات 500 ملي - عبوات 250 ملي - عبوات 100 ملي"
    },
    {
      "image":"assets/images/Pyraclostrobin.jpeg",
      "name":"بيراكلوستروبين 12.8% + بوسكاليد 25.2% (بليز) ",
      "concentration":"12.5 +25.2",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"بيراكلوستروبين 12.8% + بوسكاليد 25.2% (بليز) بليمبيد فطري جهازي موضعي يحتوي على مادتين فعاليتين مميزتين بيراكلوستروبين 12.8% + بوسكاليد 25.2%، يعمل وقائياّ لمكافحة مدى واسع من الأمراض كالبياض الدقيقي، تبقعات الأوراق، أعفان الثمار، الأنتراكنوز واللفحات المبكرة وعلى العديد من المحاصيل الزراعية كالخضار والفاكهة.",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر - عبوات 500 ملي - عبوات 250 ملي - عبوات 100 ملي"
    },
    {
      "image":"assets/images/Emexazole.jpeg",
      "name":"يمكسازول ٣٠٪ (Hymexazol 30% SL)",
      "concentration":"30",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"يمكسازول ٣٠٪ (Hymexazol 30% SL) مبيد فطرى متخصص لمكافحة أمراض التربة (فطريات تعفن البذور وموت البادرات وأعفان الجذور، خاصة البيثيوم والفيوزاريوم بكفاءة عالية، على العديد من المحاصيل الحقلية والخضر والفاكهة ونباتات الزينة والشتلات، فى البيوت المحمية والأرض المفتوحة.",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر - عبوات 500 ملي"
    },
    {
      "image":"assets/images/Epoxyconazole.jpeg",
      "name":"ايبوكسيكونازول 12.5% - Epoxyconazole  sc",
      "concentration":"12.5",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"ايبوكسيكونازول 12.5% - Epoxyconazole  sc مبيد فطري جهازى حديث ومتميز ( يحتوي اللتر منه على 125 جرام من المادة الفعالة إيبوكسيكونازول ). ومتخصص فى مكافحة مدى واسع من الأمراض الفطرية الهامة المؤثرة على الإنتاج. وصفة خاصة تبقع الأوراق السركسبورى والأصداء والبياض الدقيقي وتبقعات الأوراق على بنجر السكر. والعديد من المحاصيل الحقلية الأخرى مثل الفول السوداني، ومحاصيل الحبوب، والقمح، والأرز، والموز، وغيرها",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر - عبوات 500 ملي"
    },
    {
      "image":"assets/images/Cytokinin.jpeg",
      "name":"سيتوكينين - Cytokinin 4%",
      "concentration":"12.5",
      "categoryName":"منظمات نمو منتج نهائي",
      "Description":"سيتوكينين - Cytokinin 4% منظم نمو يحتوي على سيتوكينين 4% وأوكسنين 4% مركب سيتوكير مصُنع بتكنولوجيا إسبانية، وبنسب مميزة من منظمات النمو، التي تسمح للنبات النمو المتوازن، نتيجة للدور الفسيولوجي الذي يقوم به زيادة في النمو ومرونة الخلايا وتنشيط الأنزيمات",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر  - عبوات 100 ملي"
    },
    {
      "image":"assets/images/35Imidaclopride.jpeg",
      "name":"اميداكلوبرايد ",
      "concentration":"35",
      "categoryName":"مبيدات حشرية منتج نهائي",
      "Description":"ميداكلوبرايد  - Imidaclopride 35% sc مبيد حشري جهازي وبالملامسه .جهازي يعني :المبيدات التي تمتص عن طريق الجذور أو الأوراق وتتحرك إلى باقي أجزاء النبات عن طريق أوعية الخشب واللحاءيستخدم المبيد لمكافحة العديد من الحشرات منها: الذبابة البيضاء - ذبابة القرعيات - ذبابة الثمار - صانعات الإنفاق -  النطاطات - آكلات الاوراق - ثاقبات الأوراق - البق الدقيقي - البق الاسترالي - المن - المن الدقيقي- السوس - خنفساء كلورادو - خنفساء البطاطس - دودة القطن - دودة ثمار العنب - الجراد - الجاسيد - الثربس - الحشرات القشريه - البسيلا - سوسة النخيل - سواحة الصوف - فراشة درنات البطاطس - حشرة الدوباس - حفار ساق النخيل. ",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر - عبوات 500 ملي - عبوات 250 ملي - عبوات 100 ملي"
    },
    {
      "image":"assets/images/70imidaclopride.jpeg",
      "name":"اميداكلوبرايد ",
      "concentration":"70",
      "categoryName":"مبيدات حشرية منتج نهائي",
      "Description":"اميداكلوبرايد  -  Imidaclopride 70% wg مبيد حشري جهازي وبالملامسه .:من المبيدات التي تمتص عن طريق الجذور أو الأوراق وتتحرك إلى باقي أجزاء النبات عن طريق أوعية الخشب واللحاء يستخدم المبيد لمكافحة العديد من الحشرات منها:الذبابة البيضاء - ذبابة القرعيات - ذبابة الثمار - صانعات الإنفاق -  النطاطات - آكلات الاوراق - ثاقبات الأوراق - البق الدقيقي - البق الاسترالي - المن - المن الدقيقي- السوس - خنفساء كلورادو - خنفساء البطاطس - دودة القطن - دودة ثمار العنب - الجراد - الجاسيد - الثربس - الحشرات القشريه - البسيلا - سوسة النخيل - سواحة الصوف - فراشة درنات البطاطس - حشرة الدوباس - حفار ساق النخيل. ",
      "counter":"متوفر الان : شكاير 25 كيلو - عبوات 1 كيلو - عبوات 50 جرام"
    },
    {
      "image":"assets/images/Pyriproxyfen .jpeg",
      "name":"بايريبروكسيفين  ",
      "concentration":"10",
      "categoryName":"مبيدات حشرية منتج نهائي",
      "Description":"ايريبروكسيفين Pyriproxyfen 10% EC منظم نمو حشري RGI فعال بتركيز منخفض لمكافحة الذبابة البيضاء بمختلف أنواعها وذلك بمنع فقس البيوض والإخلال بعمليات النمو والتطور للحوريات مما يؤدي إلى موتها. أدميرال لا يؤثر على الجهاز العصبي للحشرة وكذلك فهو مختص في مراحل معينة من حياة الحشرة دون غيرها وبذلك فهو آمن على البيئة والأعضاء الحيوية ",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر - عبوات 500 ملي -"
    },
    {
      "image":"assets/images/Ethoprofos .jpeg",
      "name":"إيثوبروفوس ",
      "concentration":"40",
      "categoryName":"مبيدات حشرية منتج نهائي",
      "Description":"يثوبروفوس 40 % (ETHOPROPHOS 40% EC) مركز قابل للأستحلاب مبيد نيماتودى فوسفورى عضوى غير جهازى يعمل بالملامسة ويعمل كمبيد حشرى فى  التربة .و يكافح النيماتودا المتطفلة وحشرات التربة التى تصيب البطاطس ، الطماطم ، الفروالة ، القرعيات ، الذرة ، فول الصويا ، الفول السودانى ، قصب السكر ، البطاطا ، الموز ، الموالح ، الأناناس ، نباتات الزينة ومحاصيل أخرى .",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر"
    },
    {
      "image":"assets/images/Oxamyl .jpeg",
      "name":"اوكساميل ",
      "concentration":"5",
      "categoryName":"مبيدات حشرية منتج نهائي",
      "Description":"يثوبروفوس اوكساميل oxamyl 24.L يستعمل المبيد لمقاومة العديد من أنواع النيماتودا مثل نيماتودا تعقد الجذور ونيماتودا التقزم ونيماتودا تقرح الجذور، الحويصلات والنيماتودا الكلوية في العديد من محاصيل الخضروات والمحاصيل الحقلية وأشجار الفاكهة والنخيل ونباتات الزينة ونيماتودا التدهور السريع في الموالح.",
      "counter":"متوفر عبوات : برميل 200 لتر- عبوات 5 لتر - عبوات 1 لتر"
    },
    {
      "image":"assets/images/thiophanatemethyl.jpeg",
      "name":"ثيوفانات ميثيل ",
      "concentration":"70",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"ثيوفانات ميثيل Thiophanate-methyl 70% مبيد فطري مسحوق قابل للبلل هو مبيد (يحتوى الكيلوجرام منه على٧٠٠ جرام من المادة الفعالة ثيوفانات ميثيل) ومتخصص لمكافحة العديد من الأمراض الفطرية خاصة البياض الدقيقي والأعفان والتبقعات ,",
      "counter":"متوفر شكاير 25 كيلو - عبوات كيلو"
    },
    {
      "image":"assets/images/Aluminumfosteel.jpeg",
      "name":"فوستيل ألومنيوم",
      "concentration":"80",
      "categoryName":"مبيدات فطرية مصنعة",
      "Description":"وستيل ألومنيوم 80%  - Fosetyl-Aluminium 80% مبيد فطري وقائي وعلاجي لأمراض أعفان الجذور والتصمغات على أشجار الفاكهة حيث أن له القدرة على الانتقال إلى جميع أجزاء النباتات المعاملة به من خلال العصارة النباتية وبالتالي تواجده في جميع أنسجة النباتات المعاملة به. هذه الميزة تمكنه من القضاء على الفطريات المسببة للأمراض السابق ذكرها.",
      "counter":"متوفر شكاير 25 كيلو - عبوات كيلو"
    }

  ]
}
